# Semi-automatic installation of apps

# Install Cask
# -------------
tap 'caskroom/cask'

# Produtivity
cask 'alfred'
cask 'evernote'
cask 'freemind'

# Utils
cask 'appcleaner'
cask 'flux'
cask 'caffeine'
cask 'the-unarchiver'
cask 'gfxcardstatus'

# Development
cask 'iterm2'
cask 'macvim'
cask 'atom'
cask 'eclipse-ide'
cask 'java'
cask 'dia' # Requires XQuartz, download from:

# Documents
cask 'texmaker' # Requires Mactex, download from: 
cask 'libreoffice'
cask 'calibre'

# Image
cask 'gimp'
cask 'inkscape' # Requires XQuartz
cask 'blender'

# Android
cask 'android-file-transfer'
cask 'android-studio' # Requires Java

# Virtualization
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Internet
cask 'cyberduck'
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'google-drive'
cask 'google-hangouts'
cask 'transmission'
cask 'skype'

# Music
cask 'spotify'

# Video
cask 'vlc'

# NTFS
cask 'osxfuse'
tap 'homebrew/fuse'
brew 'ntfs-3g'

# Quicklook extensions
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'betterzipql'
cask 'quicklook-csv'
cask 'webpquicklook'
cask 'epubquicklook'
cask 'animated-gif-quicklook'
